<template>
  <div>
    <v-simple-table class="secondary">
      <template v-slot:default>
        <thead>
          <tr>
            <th>الأشهر</th>
            <th>
              <div style="min-width: 70px">إسم الشركة</div>
            </th>
            <th>
              <div style="min-width: 70px">التوزيع الشهرى</div>
              </th>
            <th>
              <div style="min-width:70px;">إجمالى التوزيع</div>
            </th>
          </tr>
        </thead>
        <tbody>
          <tr v-for="item in items" :key="item.month">
            <td>
              {{ item.month }}
            </td>
            <td>
              <div v-for="company in item.companies" :key="company">
                {{ company }}
              </div>
            </td>
            <td>
              <div v-for="percentag in item.percentags" :key="percentag">
                {{ percentag }} %
              </div>
            </td>
            <td>
              <div v-for="amount in item.totals" :key="amount">
                {{ amount }} %
              </div>
            </td>
          </tr>
        </tbody>
      </template>
    </v-simple-table>
  </div>
</template>

<script>
export default {
  data() {
    return {
      items: [
        {
          month: "يناير",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "فبراير",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "مارس",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "إبريل",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "مايو",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "يونية",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "يوليو",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "أغسطس",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "سبتمبر",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "اكتوبر",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "نوفمبر",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
        {
          month: "ديسمبر",
          companies: [
            'سدافكو',
            'المملكة',
            'المجموعة السعودية',
            'سيارات',
            'الوطنية للتعليم',
            'أسمنت القصيم',
          ],
          percentags: [
            1.25,
            1.3,
            0.32,
            1.9,
            1.01,
            1.7
          ],
          totals: [
            22.0,
            51.5,
            40.5,
            80.5,
            12.5,
            11.98
          ],
        },
      ],
    };
  },
};
</script>

<style></style>
